Repository: manpages-zh/Translate
Catalog: Translate-level2.tmx
Source language: en_us
Languages: zh_cn

source: ## Background
zh_cn: ## 背景

source: #AUTHORS
zh_cn: # 作者

source: #COPYRIGHT
zh_cn: # 版权

source: #DESCRIPTION
zh_cn: # 描述

source: #ENVIRONMENT
zh_cn: # 环境变量

source: #NAME
zh_cn: # 名称

source: #OPTIONS
zh_cn: # 选项

source: #SCHEMATIC AND SYMBOL FILES
zh_cn: # 原理图和符号文件

source: #SEE ALSO
zh_cn: # 参考

source: #SYNOPSIS
zh_cn: # 语法

source: * Although two levels of section hierarchy are technically supported, most manpages use only a single level.
zh_cn: * 虽然在技术上支持两个级别的层次结构部分，大多数不失为使用只有一个单一的水平。

source: * Historically, manpages use an extremely -- unbelievably -- limited set of text formatting capabilities.
zh_cn: * 从历史上看，不失为使用极其 — — 令人难以置信 — — 有限集的文本格式设置功能。

source: * Manpages follow a well defined structure that's immediately familiar.
zh_cn: * Manpages 有着定义良好的结构，大多数人很快就能熟悉。

source: * Manpages get to the point.
zh_cn: * Manpages 抓住了重点。

source: * Manpages have a simple referencing syntax; e.g., sh(1), fork(2), markdown(7).
zh_cn: * Manpages 有一个简单的引用语法 ；例如，sh(1)，fork (2)，markdown(7)。

source: * The classical terminal manpage display is typographically well thought out.
zh_cn: * 传统终端在线显示印刷得很周全。

source: NAME
zh_cn: 名称

source: AUTHORS
zh_cn: 作者

source: ENVIRONMENT
zh_cn: 环境变量

source: COPYRIGHT
zh_cn: 版权

source: SEE ALSO
zh_cn: 请参见

source: SYNOPSIS
zh_cn: 语法

source: DESCRIPTION
zh_cn: 描述

source: OPTIONS
zh_cn: 选项

source: SCHEMATIC AND SYMBOL FILES
zh_cn: 原理图和符号文件

source: -L DIRECTORY
zh_cn: -L目录

source: -V, --version
zh_cn: -v, --verbose

source: -o, --output=FILE
zh_cn: -o， --output=文件

source: -s FILE
zh_cn: -s文件

source: gattrib [OPTION ...] [FILE ...]
zh_cn: gattrib[选项...][文件...]

source: gattrib is a spreadsheet-like tool for bulk editing of attributes in gEDA schematics, usually created in gschem(1).
zh_cn: gattrib 是一个类似电子表格的批量属性编辑器，通常用于修改在gschem(1) 中创建的属性。

source: gschem [OPTION ...] [--] [FILE ...]
zh_cn: gschem [选项 ...] [--] [文件 ...]

source: gschem can also be used for editing symbols for use in schematics.
zh_cn: gschem 也可以用于编辑在图表中使用的符号。

source: gschem is a schematic capture application, and is part of the gEDA (GPL Electronic Design Automation) toolset.
zh_cn: gschem 是一个原理图捕获工具，它是 gEDA（GPL 电子设计自动化）工具集的一部分。

source: Any schematic or symbols specified are loaded at startup as separate documents in the schematic editor.
zh_cn: 任何指定的原理图或符号都会在启动时在原理图编辑器中作为单独文件被加载。

source: Automatically place the window.
zh_cn: 自动放置窗口。

source: Because they're written in an inverted style, with a SYNOPSIS section followed by additional detail, prose and references to other sources of information, manpages provide the best of both cheat sheet and reference style documentation.
zh_cn: 因为它们写在一个倒置的风格，与其后附加详细信息、 散文和其他来源的信息，对引用的简介部分不失为提供最好的两个骗子表和参考样式文档。

source: HTML versions can use this to generate links between pages.
zh_cn: 可以用此来生成 HTML 版本中页面间的链接。

source: I disagree:
zh_cn: 但我不这么认为：

source: If no FILEs are specified, a blank schematic is created for editing.
zh_cn: 如果没有指定 FILEs ，则创建一个空白的原理图。

source: If no FILEs to open are specified on the command line, gattrib will display a file selector dialog on startup.
zh_cn: 如果在命令行上没有指定要打开的文件s ，则 gattrib 会在启动时显示文件选择器对话框。

source: It is used to draw electronic schematics, which describe the logical structure of an circuit.
zh_cn: 它被用来绘制电子原理图，描述电路的逻辑结构。

source: Normally gschem searches for the system configuration file, then ‘$HOME/.gEDA/gschemrc’, and finally for a ‘gschemrc’ file in the current working directory.
zh_cn: 通常gschem 先搜索系统配置文件，然后是 '$HOME/.gEDA/gschemrc'，最后是当前的工作目录中的 'gschemrc' 文件。

source: Optionally, schematic or symbol FILEs may be specified on the command line.
zh_cn: 可选，原理图或符号 FILES 可在命令行上指定。

source: Output all diagnostic information.
zh_cn: 输出所有的诊断信息。

source: Output to various image formats is also supported.
zh_cn: 此外也支持对各种图像格式的输出。

source: Please see the ‘COPYING’ file included with this
zh_cn: 请参阅该程序附带的 ‘COPYING’文件。

source: Prepend DIRECTORY to the list of directories to be searched for Scheme files.
zh_cn: 追加一个 Scheme 文件搜索目录。

source: Print gschem version information.
zh_cn: 打印 gschem 的版本信息。

source: Print a help message.
zh_cn: 打印帮助信息。

source: Quiet mode.
zh_cn: 安静模式。

source: Remember that Feynman covered all of physics -- heavenly bodies through QED -- with only two levels of document hierarchy (The Feynman Lectures on Physics, 1970).
zh_cn: 记得曼覆盖的所有物理学 — — 通过 QED 的天体 — — 只有两个级别的文档层次结构 （费曼物理学，1970年讲义）。

source: Schematics are made up of symbols, which represent the various components in the circuit, and are obtained either from a standard library or created by the user.
zh_cn: 原理图由表示电路中各种组件的符号构成，这些符号可以从标准库得到或由用户创建。

source: Schematics may be printed to a PostScript file for printing or further conversion to other output formats.
zh_cn: 原理图可以输出到 PostScript 文件，以便打印或进一步转换到其他输出格式。

source: See the ‘AUTHORS’ file included with this program.
zh_cn: 请参阅该程序附带的 ‘AUTHORS’文件。

source: Some think UNIX manual pages are a poor and outdated form of documentation.
zh_cn: 有些人认为 UNIX 手册页是一种薄弱且过时的文件形式。

source: Specify a Scheme expression to be evaluated at startup.
zh_cn: 指定在启动时所要执行的 Scheme 脚本。

source: Specify a Scheme script to be executed at startup.
zh_cn: 指定在启动时所要执行的 Scheme 脚本。

source: Specify a filename for PostScript output.
zh_cn: 为 PostScript 输出指定一个文件名。

source: Specify an additional configuration file.
zh_cn: 指定一个额外的配置文件。

source: The connections between components represented by nets (wires).
zh_cn: 符号之间由 nets（电线）连接。

source: The default is ‘$GEDADATA’.
zh_cn: 默认是‘$GEDADATA’.

source: The default is ‘${prefix}/share/gEDA’.
zh_cn: 默认是 ‘${prefix}/share/gEDA’。

source: The filename can be changed through the print dialog box.
zh_cn: 文件名可以通过输出对话框来修改

source: The full documentation for gschem is available from within the program by selecting the ‘gEDA Documentation’ option from the program’s ‘Help’ menu.
zh_cn: 完整的 gschem 文档可从通过选择该程序“帮助”菜单中的“gEDA Documentation”获得。

source: The roff/mandoc/mdoc macro languages are highly extensible, fractured between multiple dialects, and include a bunch of device specific stuff irrelevant to modern publishing tools.
zh_cn: Roff/mandoc/mdoc 宏语言是高度扩展的裂缝之间多种方言，并且包括一堆设备特定的东西与现代出版工具无关。

source: There is NO WARRANTY, to the extent permitted by law.
zh_cn: 在法律许可的范围之内，本许可不对产品作任何的保证。

source: This command line argument is useful when running gschem from a shell script and with a Scheme script.
zh_cn: 当通过Shell 脚本或 Scheme 脚本启动 gschem 时，该命令行参数是非常有用的。

source: This gives developers a starting point when documenting new tools, libraries, and formats.
zh_cn: 这为开发人员提供一个起始点，以记录新的工具、 库和格式。

source: This is a feature.
zh_cn: 这是 Manpages 的一个特性。

source: This is free software: you are free to change and redistribute it.
zh_cn: 这是自由软件： 您还可以自由改变和重新发布它。

source: This may be useful if running gschem from the command line and generating output.
zh_cn: 当通过命令行启动 gschem 和生成输出文件时，该命令行参数是非常有用的。

source: This option allows the user to specify an additional rc file which is read after all the other rc files have been are read.
zh_cn: 此选项允许用户指定一个额外的 rc 文件，并在完成读取其他 rc 文件后读取该文件。

source: Treat all remaining arguments as schematic or symbol filenames.
zh_cn: 把所有剩余的参数作为原理图或符号的文件名。

source: Turn off all warnings/notes/messages.
zh_cn: 关闭所有警告/注意/消息。

source: Unfortunately, figuring out how to create a manpage is a fairly tedious process.
zh_cn: 不幸的是，弄清楚如何创建手册是一个非常繁琐的过程。

source: Unwieldy document hierarchies complicate otherwise good documentation.
zh_cn: 笨拙的文档层次结构复杂另有良好的文档。

source: Use this if you have a schematic or symbol filename which begins with ‘-’.
zh_cn: 如果你有一个以“ - ”开头的原理图文件名或符号名，使用这个选项。

source: Verbose mode.
zh_cn: 详细模式。

source: You get a couple of headings, lists, bold, underline and no more.
zh_cn: 你得到几个标题、 列表、 粗体、 下划线和没有更多。

source: gattrib - gEDA/gaf Schematic Attribute Editor
zh_cn: gattrib - gEDA/gaf 原理图属性编辑器

source: gschem - gEDA/gaf Schematic Capture
zh_cn: gschem - gEDA/gaf 原理图捕获程序

source: program for full details.
zh_cn: 有关程序的详细信息。

source: specifies the search directory for Scheme and rc files.
zh_cn: 指定 Scheme 和 rc 文件的搜索目录。

source: specifies the search directory for rc files.
zh_cn: 指定 Scheme 和 rc 文件的搜索目录。
